БухЭксп/Catalogs/CW_ОтслеживаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОтслеживаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСлежения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыСлежения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСлежения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСлежения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавлятьВКарточку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыПеревозок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Оборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОтслеживаемоеОборудование/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеОбъектовСлежения"));
	// --- 
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеОбъектовСлежения");
	// --- 
	Элементы.Статусы.ИзменятьПорядокСтрок = ПравоРедактирования;
	Элементы.Статусы.ИзменятьСоставСтрок = ПравоРедактирования;
	Элементы.Статусы.ТолькоПросмотр = (НЕ ПравоРедактирования);
	// ---
	
	// кэшируем свойства параметров
	_ОбновитьСвойстваПараметров();
	
	_ОбновитьУсловноеОформлениеПараметров();
	
	_УправлениеЭлементамиФормы();
	_ИнициализацияСписков();
	
	_СформироватьЗаголовок();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	//ХранениеПолногоЗначения
	Для Каждого СтрокаОбъекта из ТекущийОбъект.ПараметрыГрузоперевозки Цикл
		ДобавитьСохраняемоеПолноеЗначение(СтрокаОбъекта.Параметр, СтрокаОбъекта.ХранилищеДанных.Получить());
	КонецЦикла;
	//---ХранениеПолногоЗначения

КонецПроцедуры    

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ПараметрыГрузоперевозки.ТекущиеДанные;
	УдалитьСохраняемоеПолноеЗначение(ТекущиеДанные.Параметр);
	
КонецПроцедуры     



&НаСервере
Процедура УстановитьОтборДинамическогоСпискаСтатусы()
	
	Статусы.Отбор.Элементы.Очистить();
	
	НовыйЭлементОтбора =  Статусы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОбъектСлежения");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение 	= ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);
	НовыйЭлементОтбора.Использование 	= Истина; 
	
	Если ПоказатьТекущийСтатус Тогда
		ЭлементОтбора = Статусы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТекущийСтатус");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Истина;
		ЭлементОтбора.Использование 	= Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура _ОбновитьСвойстваПараметров()
	// --- 
	
	КартаПравПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	АдресКартыПравПараметров = ПоместитьВоВременноеХранилище(КартаПравПараметров, ЭтаФорма.УникальныйИдентификатор);
	// --- 
	КартаСвойствПараметров = _БЭ.ПолучитьСоответствиеСвойствПараметров();
	АдресКартыСвойствПараметров = ПоместитьВоВременноеХранилище(КартаСвойствПараметров, ЭтаФорма.УникальныйИдентификатор);	
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_УправлениеЭлементамиФормы();
	_ИнициализацияСписков();
	
КонецПроцедуры    

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _СформироватьЗаголовок()
	// --- 
	
	Заголовок = Объект.Наименование;
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ИнициализацияСписков()
	
	Грузоперевозки.Параметры.УстановитьЗначениеПараметра("ОтслеживаемоеОборудование",Объект.Ссылка);
	Элементы.Грузоперевозки.Обновить();
	
	УстановитьОтборДинамическогоСпискаСтатусы();
	
КонецПроцедуры

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.Типоразмер.Видимость = (Объект.Оборудование.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Контейнер);
	// --- 
	Элементы.СтраницаГрузоперевозки.Видимость = (НЕ Объект.Ссылка.Пустая());
	Элементы.СтраницаСтатусы.Видимость = (НЕ Объект.Ссылка.Пустая());
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	
	_ОборудованиеПриИзменении();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура _ОборудованиеПриИзменении()
	// --- 
	
	// заполняем значения параметров из оборудования
	_ЗаполнитьЗначенияПараметровИзОбъектаОборудования();
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ВариантСлеженияПриИзменении(Элемент)
	
	_СформироватьНаименование();
	_ВариантСлеженияПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ВариантСлеженияПриИзменении()
	// --- 
	
	// загружаем параметры из варианта слежения
	Объект.ПараметрыГрузоперевозки.Загрузить(Объект.ВариантСлежения.ПараметрыГрузоперевозки.Выгрузить());
	
	// заполняем значения из оборудования
	_ЗаполнитьЗначенияПараметровИзОбъектаОборудования();	
	// --- 
	
	_ОбновитьУсловноеОформлениеПараметров();
	
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьЗначенияПараметровИзОбъектаОборудования()
	
	ПараметрыОборудования = Объект.Оборудование.ПараметрыГрузоперевозки.Выгрузить();
	
	Для каждого Стр Из ПараметрыОборудования Цикл
		
		Отбор = Новый Структура("Параметр",Стр.Параметр);
		мСтроки = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() = 0 Тогда 
			СтрокаПараметра = Объект.ПараметрыГрузоперевозки.Добавить();
			СтрокаПараметра.Параметр = Стр.Параметр;
		Иначе
			СтрокаПараметра = мСтроки[0];
		КонецЕсли;
		СтрокаПараметра.Значение 			= Стр.Значение;
		СтрокаПараметра.Примечание 			= Стр.Примечание;
		СтрокаПараметра.ДобавлятьВКарточку 	= Истина;
		
	КонецЦикла; 
	
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _СформироватьНаименование()
	// --- 
	
	РО = РеквизитФормыВЗначение("Объект");
	РО.СформироватьНаименование();
	ЗначениеВРеквизитФормы(РО,"Объект");
	
	_СформироватьЗаголовок();
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

#Область ДобавлениеПараметров 

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПараметра",ЭтотОбъект); 
	
	ПарамерыФормыВыбора = Новый Структура;
	ПарамерыФормыВыбора.Вставить("ВыборГруппИЭлементов"	, ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПарамерыФормыВыбора.Вставить("Множественныйвыбор"	, Истина);
	ПарамерыФормыВыбора.Вставить("Отбор"				, Новый Структура("ЭтоКонтрольнаяДата",Ложь)); // ограничиваем только контрольные даты
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПарамерыФормыВыбора,Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПараметра(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> Неопределено Тогда
		
		Если ТипЗнч(Ответ) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
			Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
		КонецЕсли;
		
		Для каждого Параметр из Ответ Цикл
			
			Если  _ПараметрЯвляетсяГруппой(Параметр) Тогда
				
				МассивДобавляемых = _ЭлементыГруппыПараметров(Параметр);
				Для каждого ДобавляемыйПараметр из  МассивДобавляемых Цикл
					// проверяем, что параметр новый
					Если ДобавляемыйПараметрНовый(ДобавляемыйПараметр) Тогда
						ИдентификаторДобавленнойСтроки = _ДобавитьПараметр(ДобавляемыйПараметр);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				// проверяем, что параметр новый
				Если ДобавляемыйПараметрНовый(Параметр) Тогда
					ИдентификаторДобавленнойСтроки = _ДобавитьПараметр(Параметр);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция _ПараметрЯвляетсяГруппой(Параметр)
	// --- 
	
	Возврат(Параметр.ЭтоГруппа);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЭлементыГруппыПараметров(ГруппаПараметров)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", ГруппаПараметров);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат(ТЗ.ВыгрузитьКолонку("Ссылка"));
	
	// --- 
КонецФункции

&НаКлиенте
Функция ДобавляемыйПараметрНовый(Параметр)
	// --- 
	
	Отбор = Новый Структура("Параметр",Параметр);
	СтрокиПараметра = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
	Возврат(СтрокиПараметра.Количество()=0);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДобавитьПараметр(Параметр)
	
	// добавляем в ТЧ параметров
	СтрокаПараметра = Объект.ПараметрыГрузоперевозки.Добавить();
	СтрокаПараметра.Параметр 			= Параметр;
	СтрокаПараметра.ДобавлятьВКарточку 	= Истина;

	//ХранениеПолногоЗначения
	ДобавитьСохраняемоеПолноеЗначение(СтрокаПараметра.Параметр);
	//---ХранениеПолногоЗначения

	_ОбновитьУсловноеОформлениеПараметров();

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти 

&НаСервере
Процедура _ОбновитьУсловноеОформлениеПараметров()
	// --- 
	
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	// --- 
	
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	Для каждого Стр Из Объект.ПараметрыГрузоперевозки Цикл
		
		ФорматВывода = Стр.Параметр.ФорматВывода;
		Если (ФорматВывода = "") Тогда
			
			СвойстваПараметра = СвойстваПараметров.Получить(Стр.Параметр);
			Если (СвойстваПараметра = Неопределено) Тогда
				КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
				СвойстваПараметра = КартаСвойств.Получить(Стр.Параметр);
			КонецЕсли;
			ТипЗначенияПараметра = СвойстваПараметра.ТипЗначения;
			ТипПараметра = СвойстваПараметра.ТипЗначения.Типы()[0];
			Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
				
				Если (НЕ СвойстваПараметра.КонтрольнаяДатаИспользуетВремя) Тогда
					ФорматВывода = "ДФ=dd.MM.yyyy";
				Иначе
					ФорматВывода = "ДФ='dd.MM.yyyy HH:mm'";
				КонецЕсли; 
				
			Иначе
				
				Если (ТипПараметра = Тип("Булево") ИЛИ ТипПараметра = Тип("Дата") ИЛИ ТипПараметра=Тип("Число")) Тогда
					
					Если ТипПараметра = Тип("Дата") Тогда
						
						ФорматВывода = "";
						ЧастьДаты = ТипЗначенияПараметра.КвалификаторыДаты.ЧастиДаты;
						Если ЧастьДаты = ЧастиДаты.Дата Тогда
							
							// формат дат по умолчанию
							ФорматВывода = "ДФ=dd.MM.yyyy";
							
						ИначеЕсли ЧастьДаты = ЧастиДаты.Время Тогда 
							
							// формат дат по умолчанию
							ФорматВывода = "ДФ=HH:mm:ss";
							
						ИначеЕсли ЧастьДаты = ЧастиДаты.ДатаВремя Тогда 
							
							// формат дат по умолчанию
							ФорматВывода = "ДЛФ=";
							
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли; 					
				
			КонецЕсли;  
		КонецЕсли; 
		Если (ФорматВывода <> "") Тогда
			УО = _УФС.ДобавитьПростоеУсловноеОформление(ЭтаФорма,"Объект.ПараметрыГрузоперевозки.Параметр",,Стр.Параметр,"ПараметрыГрузоперевозкиЗначение","Формат",ФорматВывода);
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 

// --- 

#Область РедактированиеПараметров 

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.ПараметрыГрузоперевозки.ТекущийЭлемент.Имя = "ПараметрыГрузоперевозкиДобавлятьВКарточку" Тогда
		Возврат;
	Конецесли;
	
	Отказ = Истина;
	Идентификатор = Элементы.ПараметрыГрузоперевозки.ТекущаяСтрока;
	СтрокаТЧ = Объект.ПараметрыГрузоперевозки.НайтиПоИдентификатору(Идентификатор);
	// ---------------------------------------------------------------------------- 
	
	Параметр = Элемент.ТекущиеДанные.Параметр;
	// --- 
	ПараметрТолькоПросмотр = _ТолькоПросмотр(Параметр);
	СвойстваПараметра = _БЭ.СтруктураСвойствПараметра(Параметр);	
	Если (СвойстваПараметра.Ведомый) Тогда
		
		// проверяем ведущие на заполненность
		Результат = _ПроверитьЗаполнениеВедущих(Параметр,СвойстваПараметра.СписокВедущих);
		Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
			
			_УФК.ВывестиПредупреждение("Данный параметр является зависимым!");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли; 
	Если (СвойстваПараметра.ДинамическийПараметр) Тогда
		
		_УФК.ВывестиПредупреждение("Динамические параметры не редактируются");
		Возврат;
		
	КонецЕсли;
	// --- 
	АдресОбъекта 	= _АдресОбъекта();
	ВыбраннаяФорма 	= Неопределено;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим"					,"РедактированиеОбъекта");
	ПараметрыФормы.Вставить("Параметр"				, Параметр);
	ПараметрыФормы.Вставить("АдресСвойствПараметра"	, ПоместитьВоВременноеХранилище(СвойстваПараметра,ЭтаФорма.УникальныйИдентификатор));
	ПараметрыФормы.Вставить("АдресОбъекта"			, АдресОбъекта);
	ПараметрыФормы.Вставить("ТолькоПросмотр"		, ПараметрТолькоПросмотр);
	ПараметрыФормы.Вставить("Значение"			    , СтрокаТЧ.Значение);

	//ХранениеПолногоЗначения  
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда
		Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
			ПолноеЗначение = СохраняемоеПолноеЗначение.Получить(Параметр);
		КонецЕсли;
		ПолноеЗначение = ?(ПолноеЗначение=Неопределено, СтрокаТЧ.Значение, ПолноеЗначение);
		
		ПараметрыФормы.Вставить("ПолноеЗначение", ПолноеЗначение);
	КонецЕсли;
	//---ХранениеПолногоЗначения


	ПОВ = Новый ОписаниеОповещения("ОбработатьИзменениеПараметра",ЭтотОбъект,Новый Структура("СвойстваПараметра,Параметр",СвойстваПараметра,Параметр));
	
	Если СвойстваПараметра.ИспользоватьФормуВыбораОбъекта тогда
		Если Не ПараметрТолькоПросмотр Тогда
			ВыбраннаяФорма = СвойстваПараметра.ИмяФормыВыбора;
			
			ПараметрыФормы.Вставить("РежимВыбора"		,         Истина);
			ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",         Истина);
			
			Если СвойстваПараметра.ИспользуютсяДополнительныеЗначения Тогда
				ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец",Параметр));
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если СвойстваПараметра.ИспользуетсяВнешняяОбработкаПередНачаломИзменения Тогда
			СтруктураПараметров = _ПО.ПолучитьИмяФормыНаСервере(Параметр, АдресОбъекта);
			ВыбраннаяФорма 		= "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
			
			ОбработчикНеИспользуется = Ложь;
			Если СтруктураПараметров.Свойство("НеИспользуется") Тогда
				ОбработчикНеИспользуется = СтруктураПараметров.НеИспользуется;
			КонецЕсли;
			
			Если СтруктураПараметров.Свойство("ТолькоПросмотр") Тогда
				Если  НЕ ПараметрыФормы.ТолькоПросмотр Тогда
					ПараметрыФормы.ТолькоПросмотр =  СтруктураПараметров.ТолькоПросмотр;
				КонецЕсли;
			КонецЕсли;
			
			Если СтруктураПараметров.Свойство("ПодключаемыйОбъект") Тогда
				ПараметрыФормы.Вставить("ПодключаемыйОбъект",СтруктураПараметров.ПодключаемыйОбъект);
			КонецЕсли; 
			
			Если ОбработчикНеИспользуется ИЛИ 
				СтруктураПараметров.РежимОткрытия = 1 Тогда
				ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
			ИначеЕсли	СтруктураПараметров.РежимОткрытия = 0 Тогда
				ВыбраннаяФорма = СтруктураПараметров.ИмяФормы;
			КонецЕсли;

		Иначе
			ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
		КонецЕсли;

	КонецЕсли;
	
	Если ВыбраннаяФорма <> Неопределено Тогда
		ОткрытьФорму(ВыбраннаяФорма, ПараметрыФормы,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция _АдресОбъекта()

	ТаблицаПараметров = Объект.ПараметрыГрузоперевозки.Выгрузить();
	ТаблицаПараметров.Колонки.Добавить("ХранилищеДанных"); 
	ТаблицаПараметров.Очистить(); 
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого СтрокаТаблицы из ТОбъект.ПараметрыГрузоперевозки Цикл
		НоваяСтрока = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
		
		НоваяСтрока.ХранилищеДанных = Новый ХранилищеЗначения(СтрокаТаблицы.ХранилищеДанных.Получить());
	КонецЦикла;
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка", 			Объект.Ссылка);
	СтруктураОбъекта.Вставить("ТаблицаПараметров", 	ТаблицаПараметров);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураОбъекта,ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция _ТолькоПросмотр(Параметр)
	// --- 
	
	ТолькоПросмотр = Истина;
	
	НаборПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	Попытка
		
		ТолькоПросмотр = (НЕ НаборПрав["п_"+_сф.КлючПоСсылке(Параметр)].Редактирование);
		
	Исключение
		ТолькоПросмотр = Истина;
	КонецПопытки; 
	
	Возврат(ТолькоПросмотр);
	
	// --- 
КонецФункции

&НаСервере
Функция _ПроверитьЗаполнениеВедущих(Параметр,СписокВедущих)
	// --- 
	
	// контроллируем заполнение и единство
	ФлагОшибки = Ложь;
	ТекстОшибки = "";
	Для каждого ВедущийПГ Из СписокВедущих Цикл
		
		// проверяем параметр у переданных объектов
		МассивНепустыхЗначений = Новый Массив;
		
		ВедущийПараметр = ВедущийПГ.Значение;
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,"Параметр",ВедущийПараметр);
		Если СтрокаПараметра = Неопределено Тогда
			
			ЗначениеПараметра = Неопределено;
			
		Иначе
			
			ЗначениеПараметра = СтрокаПараметра.Значение;
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			
			_сф.м_ДобавитьУникально(МассивНепустыхЗначений,ЗначениеПараметра);
			
		Иначе
			
			ФлагОшибки = Истина;
			ТекстОшибки = "";
			
		КонецЕсли; 
		
		
		// теперь если нет ошибки считаем количество
		// если не 1, то выдаём ошибку
		Если НЕ ФлагОшибки Тогда
			
			Если МассивНепустыхЗначений.Количество() <> 1 Тогда
				
				ФлагОшибки = Истина;
				ТекстОшибки = ""
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ФлагОшибки Тогда
			
			// тут необходимо закрыть форму и вернуть описание ошибки
			ТекстОшибки = "Условия отбора для выбранного параметра ("""+Параметр.Наименование+""") требуют, чтобы было задано значение параметра """+ВедущийПараметр.Наименование+""".";
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура ОбработатьИзменениеПараметра(Ответ,ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если ТипЗнч(Ответ) <> Тип("Структура") И ТипЗнч(Ответ) <> Тип("Массив") Тогда
			//В случае если ответ форме не имеет тип структура, поместим его в структуру для последующей обработки
			Ответ = _ПО.ПолучитьСтруктуруОтветаВнешнейФормы(Ответ, ДополнительныеПараметры.Параметр);
		КонецЕсли;
		
		Если ТипЗнч(Ответ) <> Тип("Массив") Тогда
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Ответ);
		Иначе
			МассивПараметров = Ответ;
		КонецЕсли;
		
		
		Для каждого ОтветСтруктура из МассивПараметров Цикл
			
			Если (ОтветСтруктура.ПараметрИзменен) Тогда
				
				Если (ДополнительныеПараметры.СвойстваПараметра = Неопределено) Тогда
					СписокВедомых = Неопределено;
				Иначе	
					СписокВедомых = ДополнительныеПараметры.СвойстваПараметра.СписокВедомых;
				КонецЕсли; 
				// --- 
				Ответ = _ОбновитьПараметр(ОтветСтруктура, СписокВедомых);	
				Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
					
					ЭтаФорма.Модифицированность = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ОбновитьПараметр(СтруктураПараметра, СписокВедомых)
	// --- 
	
	Параметр = СтруктураПараметра.Параметр;
	// --- 
	КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	СП = КартаСвойств.Получить(Параметр);
	КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	НП = КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
	// --- 
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Новый Структура("Параметр",Параметр));
	Если (СтруктураПараметра.Значение <> Неопределено) Тогда
		СтрокаПараметра.Значение = СтруктураПараметра.Значение;
	КонецЕсли; 
	Если (СП.ЭтоКонтрольнаяДата) Тогда
		Если (СтрокаПараметра.ЗначениеПлан <> Неопределено) Тогда
			СтрокаПараметра.ЗначениеПлан = СтруктураПараметра.ЗначениеПлан;
		КонецЕсли;
		Если (СтрокаПараметра.ЗначениеФакт <> Неопределено) Тогда
			СтрокаПараметра.ЗначениеФакт = СтруктураПараметра.ЗначениеФакт;
		КонецЕсли;
	КонецЕсли; 
	Если (СтрокаПараметра.Примечание <> Неопределено) Тогда
		СтрокаПараметра.Примечание = СтруктураПараметра.Примечание;
	КонецЕсли;

	//ХранениеПолногоЗначения  
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда 
		ДобавитьСохраняемоеПолноеЗначение(Параметр, СтруктураПараметра.ПолноеЗначение);  
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
	Ответ = _УФКС.Ответ();
	Возврат(Ответ);
	
	// --- 
КонецФункции

#КонецОбласти 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОкончаниеСлеженияПриИзменении(Элемент)
	
	Если (ЗначениеЗаполнено(Объект.НачалоСлежения)) Тогда
		
		Если (Объект.ОкончаниеСлежения < Объект.НачалоСлежения) Тогда
			
			Объект.ОкончаниеСлежения = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоСлеженияПриИзменении(Элемент)
	
	Если (ЗначениеЗаполнено(Объект.ОкончаниеСлежения)) Тогда
		
		Если (Объект.ОкончаниеСлежения < Объект.НачалоСлежения) Тогда
			
			Объект.ОкончаниеСлежения = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли; 
	_СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование(Команда)
	_СформироватьНаименование();
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаПерезаполнитьПараметрыВедомых(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияПерезаписиПараметров",ЭтотОбъект, Новый Структура()); 
	ПоказатьВопрос(ПОВ,"Прописать параметры в связанные грузоперевозки?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаПодтвержденияПерезаписиПараметров(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	мГрузоперевозок = ПолучитьМассивГрузоперевозокОбъектаНаСервере(Объект.Ссылка);
	ВсегоЗначений 	= мГрузоперевозок.Количество();
	
	АдресПараметров = ПодготовитьПараметрыДляЗаполнения();
	
	Для Индекс = 0 по мГрузоперевозок.ВГраница() Цикл 
		
		Прогрес = (Индекс + 1) * 100 / ВсегоЗначений;

		Грузоперевозка = мГрузоперевозок.Получить(Индекс);
		
		ПерезаполнитьПараметрыНаСервере(Грузоперевозка, АдресПараметров);

		Состояние("Заполнение параметров грузоперевозок...", Прогрес, Строка(Грузоперевозка));
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыДляЗаполнения()
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Параметр КАК Параметр,
	               |	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Значение КАК Значение,
	               |	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Примечание КАК Примечание
	               |ИЗ
	               |	Справочник.CW_ОтслеживаемоеОборудование.ПараметрыГрузоперевозки КАК CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаПараметров = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаПараметрв Из Объект.ПараметрыГрузоперевозки Цикл
		Если СтрокаПараметрв.ДобавлятьВКарточку = ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПараметрв);
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПараметров, УникальныйИдентификатор);

КонецФункции
		
&НаСервереБезКонтекста
Функция ПолучитьМассивГрузоперевозокОбъектаНаСервере(ОбъектСлежения)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.ОтслеживаемоеОборудование = &ОбъектСлежения";
	
	Запрос.УстановитьПараметр("ОбъектСлежения", ОбъектСлежения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПерезаполнитьПараметрыНаСервере(Грузоперевозка, АдресПараметров)
	
	ТаблицаПараметров = ПолучитьИзВременногоХранилища(АдресПараметров);
	Если ТаблицаПараметров = Неопределено Тогда
		//странно
		Возврат;
	КонецЕсли;
	
	ГрузоперевозкаОбъект = Грузоперевозка.ПолучитьОбъект();

	Для каждого СтрокаПараметров из ТаблицаПараметров Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Параметр", СтрокаПараметров.Параметр);
		
		мСтроки = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() <> 0 Тогда
			НоваяСтрока = мСтроки[0];  //Всегда одна строка
		Иначе
			НоваяСтрока = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.Добавить();
			НоваяСтрока.Параметр	= СтрокаПараметров.Параметр;
		КонецЕсли;
		
		НоваяСтрока.Значение			= СтрокаПараметров.Значение;
		НоваяСтрока.Примечание 			= СтрокаПараметров.Примечание;
		
	КонецЦикла;
	
	ГрузоперевозкаОбъект.Записать();
	
	//Запишем стутасы
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Грузоперевозка);
	
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	//Запишем стутасы

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПараметры(Команда)
	
	_ОбновитьУсловноеОформлениеПараметров();
	
КонецПроцедуры


&НаКлиенте
Процедура СтатусыПередУдалением(Элемент, Отказ)
	
	Если (ЗначениеЗаполнено(Элементы.Статусы.ТекущиеДанные.Грузоперевозка)) Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(,"Статус сформирован автоматически. Удаление невозможно.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыСрезПоследних(Команда) 

	ПоказатьТекущийСтатус = НЕ ПоказатьТекущийСтатус;
	Элементы.СтатусыСтатусыСрезПоследних.Пометка = ПоказатьТекущийСтатус;
	
	УстановитьОтборДинамическогоСпискаСтатусы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Запись данных харнилища занчений по строкам 
	Для Каждого ЭлементСписка из СписокАдресовЗначенийПараметров Цикл
		
		//ДанныеПоАдресу - тип "Структура("Параметр, ТаблицаДанных")
		ДанныеПоАдресу = ЭлементСписка.Значение;
		
		Отбор = Новый Структура("Параметр", ДанныеПоАдресу.Параметр);
		мСтроки = ТекущийОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда
			//Предполагаем что строка будет только одна
			СтрокаДанных = мСтроки[0]; 
			СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения);	
		КонецЕсли;
		
	КонецЦикла;
	
	//ХранениеПолногоЗначения 
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда 
		Для Каждого КлючЗначение из СохраняемоеПолноеЗначение Цикл
			Отбор = Новый Структура("Параметр", КлючЗначение.Ключ);
			НайденныеСтроки = ТекущийОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				//Предполагаем что строка будет только одна
				СтрокаДанных = НайденныеСтроки[0];   
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//---ХранениеПолногоЗначения

КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОбновитьСписокПараметров(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	
	Если Объект.ПараметрыГрузоперевозки.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Список параметров будет обновлен. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ОбновитьСписокПараметровНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПараметровНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Параметр КАК Параметр,
	               |	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Значение КАК Значение,
	               |	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Примечание КАК Примечание,
	               |	ИСТИНА КАК ДобавлятьВКарточку
	               |ИЗ
	               |	Справочник.CW_ОтслеживаемоеОборудование.ПараметрыГрузоперевозки КАК CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПараметров = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.Оборудование) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ОборудованиеПараметрыГрузоперевозки.Параметр КАК Параметр,
		|	CW_ОборудованиеПараметрыГрузоперевозки.Значение КАК Значение,
		|	CW_ОборудованиеПараметрыГрузоперевозки.Примечание КАК Примечание
		|ИЗ
		|	Справочник.CW_Оборудование.ПараметрыГрузоперевозки КАК CW_ОборудованиеПараметрыГрузоперевозки
		|ГДЕ
		|	CW_ОборудованиеПараметрыГрузоперевозки.Ссылка = &Оборудование";
		
		Запрос.УстановитьПараметр("Оборудование", Объект.Оборудование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденнаяСтрока = ТаблицаПараметров.Найти(Выборка.Параметр, "Параметр");
			
			Если НайденнаяСтрока = Неопределено Тогда
				НайденнаяСтрока = ТаблицаПараметров.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока,Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВариантСлежения) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ВариантыСлеженияПараметрыГрузоперевозки.Параметр КАК Параметр,
		|	CW_ВариантыСлеженияПараметрыГрузоперевозки.Значение КАК Значение,
		|	CW_ВариантыСлеженияПараметрыГрузоперевозки.Примечание КАК Примечание
		|ИЗ
		|	Справочник.CW_ВариантыСлежения.ПараметрыГрузоперевозки КАК CW_ВариантыСлеженияПараметрыГрузоперевозки
		|ГДЕ
		|	CW_ВариантыСлеженияПараметрыГрузоперевозки.Ссылка = &ВариантСлежения";
		
		
		Запрос.УстановитьПараметр("ВариантСлежения", Объект.ВариантСлежения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденнаяСтрока = ТаблицаПараметров.Найти(Выборка.Параметр, "Параметр");
			
			Если НайденнаяСтрока = Неопределено Тогда
				НайденнаяСтрока = ТаблицаПараметров.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока,Выборка);
		КонецЦикла;
		
	КонецЕсли;

	Если ТаблицаПараметров.Количество() > 0 Тогда
		Объект.ПараметрыГрузоперевозки.Загрузить(ТаблицаПараметров);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ПараметрИзменен") Тогда
		
		_ОбновитьСвойстваПараметров();
		
	КонецЕсли; 
	
КонецПроцедуры


//ХранениеПолногоЗначения
&НаСервере
Процедура ДобавитьСохраняемоеПолноеЗначение(Параметр, ХранимоеЗначение=Неопределено)
	
	Если Не CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда   
		Возврат
    КонецЕсли;
	
	Соответствие = Новый Соответствие;
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
		Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);                                             
	КонецЕсли;
	
	Соответствие.Вставить(Параметр, ХранимоеЗначение);
	СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьСохраняемоеПолноеЗначение(Параметр)
	
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда
		Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);
		Соответствие.Удалить(Параметр); 
		СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
	КонецЕсли;
	
КонецПроцедуры

//---ХранениеПолногоЗначения

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
